<a href="https://colab.research.google.com/github/DevenSuji/MasteringPython/blob/master/Handling_CSV_Files.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Writing a CSV File

In [3]:
import csv

In [4]:
with open('accounts.csv', mode='w', newline='') as accounts:
  writer = csv.writer(accounts)
  writer.writerow([100, 'Jones', 24.98])
  writer.writerow([200, 'Doe', 345.67])
  writer.writerow([300, 'White', 0.00])
  writer.writerow([400, 'Stone', -42.16])
  writer.writerow([500, 'Rich', 224.62])

In [5]:
!cat accounts.csv

100,Jones,24.98
200,Doe,345.67
300,White,0.0
400,Stone,-42.16
500,Rich,224.62

# Reading a CSV File

In [6]:
with open('accounts.csv', 'r', newline='') as accounts:
  print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
  reader = csv.reader(accounts)
  for record in reader:
    account, name, balance = record
    print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

# Self Check
* Create a text file named grades.csv and write some records to it consisting of students ID, last names and letter grades.
* Then, read the file grades.csv and display it in columns with the column heads 'ID', 'Name'and 'Grades'

In [7]:
with open('grades.csv', mode='w', newline='') as grades:
  writer = csv.writer(grades)
  writer.writerow([1, 'Deven Suji', 98.77])
  writer.writerow([2, 'Pavithra M', 67.08])
  writer.writerow([3, 'Dhrishti Suji', 99.99])
  writer.writerow([4, 'Duganth Suji', 95.67])

In [8]:
!cat grades.csv

1,Deven Suji,98.77
2,Pavithra M,67.08
3,Dhrishti Suji,99.99
4,Duganth Suji,95.67

In [9]:
with open('grades.csv', mode='r', newline='') as grades:
  print(f'{"ID":<10}{"Name":<15}{"Grade":>10}')
  reader = csv.reader(grades)
  for item in reader:
    ID, Name, Grade = item
    print(f'{ID:<10}{Name:<15}{Grade:>10}')

ID        Name                Grade
1         Deven Suji          98.77
2         Pavithra M          67.08
3         Dhrishti Suji       99.99
4         Duganth Suji        95.67

# Handling CSV with PANDAS

In [10]:
import pandas as pd

In [12]:
df = pd.read_csv('accounts.csv', names=['account', 'name', 'balance'])

In [13]:
df

   account   name  balance
0      100  Jones    24.98
1      200    Doe   345.67
2      300  White     0.00
3      400  Stone   -42.16
4      500   Rich   224.62

In [14]:
df.to_csv('accounts_from_dataframe.csv', index=False)

In [15]:
!cat accounts_from_dataframe.csv

account,name,balance
100,Jones,24.98
200,Doe,345.67
300,White,0.0
400,Stone,-42.16
500,Rich,224.62

# Loading CSV from Internet

In [16]:
import pandas as pd

In [17]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [18]:
pd.set_option('precision', 2) # Keeping the decimal values to 2 places.

In [19]:
titanic.head() # Shows the first five records

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [20]:
titanic.tail() # Shows the last five records

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [21]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [22]:
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [23]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [24]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [25]:
%matplotlib

Using matplotlib backend: agg

In [27]:
histogram = titanic.hist()